<template>
    <div class="about_us_block">
        <img src="/images/aboutus.jpg" alt="">
        <p>Публичное акционерное общество «Астраханский порт» - один из важнейших морских портов на юге России.<br>
            Порт расположен на Волге, играет ключевую роль в транспортной инфраструктуре региона<br>
            Обеспечивает связь России со странами Каспийского бассейна.</p>

        <h2>Услуги порта</h2>
        <p>ПАО «Астраханский порт» предлагает широкий спектр услуг по выгодным тарифам, включающий:</p>
        <ul>
            <li>погрузо-разгрузочные работы</li>
            <li>транспортно-экспедиционное обслуживание</li>
            <li>таможенное оформление</li>
            <li>хранение грузов</li>
        </ul>

        <h2>ООО «АстраПорт Шиппинг»</h2>
        <p>В 2023 году на базе ПАО «Астраханский порт» открыта судоходная компания<br>
            ООО «АстраПорт Шиппинг», осуществляющая морские перевозки.</p>

        <h2>Техническое оснащение</h2>
        <p>Порт оснащен современными технологиями и оборудованием,<br>
            позволяющим обрабатывать различные виды груза:</p>

        <ul>
            <li>зерновые культуры</li>
            <li>растительные масла</li>
            <li>пиломатериалы, фанера, МДФ</li>
            <li>бумага, целлюлоза</li>
            <li>металлопрокат</li>
            <li>грузы в контейнерах</li>
            <li>продукты питания</li>
            <li>цемент</li>
            <li>минеральные удобрения</li>
            <li>кокс</li>
            <li>автотранспортные средства, спец.техника</li>
        </ul>
    </div>
</template>
<script>
</script>