<template>
    <div class="requisites-block">


        <p>Ниже приведены реквизиты компании, в случае необходимости получения дополнительных документов: свидетельства
            о государственной регистрации, идентификационного номера налогоплательщика вы можете обратиться в
            бухгалтерию предприятия.</p>
        <ul class="strip-list">
            <li><strong>Полное наименование:</strong> Публичное акционерное общество "Астраханский порт"</li>
            <li><strong>Сокращенное наименование:</strong> ПАО "Астраханский порт"</li>
            <li><strong>ИНН/КПП:</strong> 3015012854/301801001</li>
            <li><strong>ОГРН:</strong> 1023000819841</li>
            <li><strong>Юридический адрес:</strong> 414006, г. Астрахань, ул.Пушкина, 66</li>
            <li><strong>Фактический адрес:</strong> 414006, г. Астрахань, ул.Пушкина, 66</li>
            <li><strong>Телефон, факс:</strong> Приемная: (8512) 44-28-88</li>
            <li><strong>Электронная почта:</strong> astrakhanport@mail.ru</li>
            <li><strong>Сайт:</strong> <a href="https://astrakhanport.com/">https://astrakhanport.com/</a></li>
            <li><strong>Банковские реквизиты:</strong> Астраханское отделение №8625 ПАО СБЕРБАНК г. Астрахань</li>
            <li><strong>БИК:</strong> 041203602</li>
            <li><strong>р/с:</strong> 40702810605000004786</li>
        </ul>
        <div class="railway_nak">
            <h1>
                Инструкция по оформлению ж/д накладных:
            </h1>
            <p>
                Груз направлять на станцию Правый Берег, Приволжское ж/д.
            </p>

            <p>
                Код станции: Российский 616502, экспортный 619604
            </p>

            <p>
                Грузополучатель ПАО Астраханский порт, г.Астрахань, ул.Пушкина,66
            </p>

            <p>
                Код порта 2651
            </p>
        </div>
    </div>
</template>
<script setup>
</script>