<template>
    <div class="service_mainscreen">
        <img :src="pageData.image" alt="" class="service_mainscreen">
    </div>
    <div class="idk_maybeitwork">

    <div class="services_contact">

        <div class="services_contact_inner">
            <img src="/images/document.svg" class="services_contact_img">
            <div class="">
                <p class="">Оформите заявку на услугу, мы свяжемся с вами в ближайшее время и ответим на все интересующие вопросы.</p>
            </div>
            <button class="Ybtn">Заказать услугу</button>
            <button class="Xbtn">?</button>
        </div>
    </div> 
    </div>
    <div class="services_textblock" v-html="pageData.text">
    </div>
    
</template>
<script setup>
import '../../css/services.css'

import { usePage, Head } from '@inertiajs/vue3'
const servicesData = {
    'import': {
        image: "/images/import.jpg",
    },
    'tamozhnya': {
        image: "/images/tamozhnya.jpg",
    },
    'export': {
        image: "/images/import.jpg",
        text: "<p>ПАО Астраханский порт предлагает Вам безопасное и надежное партнерство в области экспорта. Наш порт – важное звено в логистической цепи г.Астрахани, которое вот уже более 20 лет обеспечивает перевозку грузов между странами и континентами.</p> <p>Наши экспортные операции включают в себя все этапы – начиная от загрузки грузов на судно и заканчивая их доставкой в пункт назначения. От исходного пункта отправляются товары различной категории – от сельскохозяйственной продукции и нефти до производственного оборудования и машин.</p><p>Наша команда экспертов готова предоставить консультации и поддержку в любом вопросе, связанным с экспортом. Мы подстроимся под ваши потребности, поможем разрешить возникшие проблемы и предложим оптимальные решения.</p><p>Одним из основных достоинств Астраханского порта является высокая грузоподъемность судов, что делает его экономически выгодным для перевозки больших объемов грузов.</p><p>Организация экспорта для нас требует тщательного планирования и соблюдения всех требований и норм, установленных международными организациями и государственными органами по безопасности при перевозке грузов. Кроме того, необходимо учесть различные аспекты, такие как упаковка груза, его маркировка и документация, чтобы гарантировать безопасность и сохранность товаров во время пути следования.</p><p>С каждым клиентом работает целая команда профессионалов, которая выполняет следующие функции:</p><ul>  <li>Разработка и заключение договоров</li>  <li>Оказание услуг организациям на погрузо-разгрузочные работы</li>  <li>Контроль за правильным обслуживанием клиентов</li>  <li>Контроль над формированием пакета документов</li>  <li>Обработка входящих документов</li>  <li>Учёт груза клиентов</li></ul> <p>Работая с нами вы получите максимальную эффективность и надежность в каждом этапе доставки груза! Обратитесь к нам сегодня и убедитесь сами в качестве наших услуг.</p>"
    },
    'termoobrabotka': {
        image: "/images/termo.png",
    },
    'teo': {
        image: "/images/kran.jpg",
    },
    'khranenie': {
        image: "/images/doski.png",
    },
    'zh-d-gruzoperevozki': {
        image: "/images/poezd.jpg",
    },
    'morskie-gruzoperevozki': {
        image: '/images/marine.jpg',
    }
}
const { url } = usePage()
const currentPath = url.split('/').pop() // получаем последнюю часть URL
const pageData = servicesData[currentPath]
</script>
